---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.Clear
source: html/d31f770f-c995-5110-5dc0-011a81b076c9.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.Clear Method

Removes every insulation type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```